       IDENTIFICATION DIVISION.
       PROGRAM-ID. DIAGNOSTIC-REPORT.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
        SELECT PATIENT ASSIGN TO "PATIENT.doc"
        ORGANIZATION IS SEQUENTIAL
        ACCESS IS SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
        FD PATIENT.
        01 PATIENT-RECORD.
           05 PATIENT-INPUT PIC X(40).
       WORKING-STORAGE SECTION.
       77 PATIENT-NAME    PIC X(20).
       77 LUNG-INFECTION  PIC 9.
       77 TEMPERATURE     PIC 9.
       77 SNIFFLES        PIC 9.
       77 SORE-THROAT     PIC 9.
       77 LABLE-OK        PIC X.
       77 ANOTHER-LABLE   PIC X.
       77 DIAGNOSTIC      PIC X(20).
       SCREEN SECTION.
       01 SCREEN-1
          BLANK SCREEN
          FOREGROUND-COLOR 2
          BACKGROUND-COLOR 7.
          05 LINE 5 COLUMN 25 VALUE "PATIENT-REPORT".
          05 LINE + 2 COLUMN 10 VALUE "PATIENT-NAME:".
          05 COLUMN + 2 PIC X(20) TO PATIENT-NAME.
          05 LINE + 2 COLUMN 8 VALUE "LUNG-INFECTION:".
          05 COLUMN + 2 PIC 9 TO LUNG-INFECTION AUTO.
          05 COLUMN + 11 VALUE "1 PRESENT".
          05 LINE + 1 COLUMN - 8 VALUE "0 ABSENT".
          05 LINE + 2 COLUMN 11  VALUE "TEMPERATURE:".
          05 COLUMN + 2 PIC 9 TO TEMPERATURE AUTO.
          05 COLUMN + 11 VALUE "1 PRESENT".
          05 LINE + 1 COLUMN - 8 VALUE "0 ABSENT".
          05 LINE + 2 COLUMN 14  VALUE "SNIFFLES:".
          05 COLUMN + 2 PIC 9 TO SNIFFLES AUTO.
          05 COLUMN + 11 VALUE "1 PRESENT".
          05 LINE + 1 COLUMN - 8 VALUE "0 ABSENT".
          05 LINE + 2 COLUMN  12 VALUE "SORE-THROAT:".
          05 COLUMN + 2 PIC 9 TO SORE-THROAT .
          05 COLUMN + 11 VALUE "1 PRESENT".
          05 LINE + 1 COLUMN - 8 VALUE "0 ABSENT".
       01 SCREEN-2
          BLANK SCREEN
          FOREGROUND-COLOR 2
          BACKGROUND-COLOR 7.
          05 LINE 8 COLUMN 10 VALUE "PATIENT-NAME:".
          05 COLUMN + 2 PIC X(20) FROM PATIENT-NAME.
          05 LINE + 1 COLUMN 8 VALUE "LUNG-INFECTION:".
          05 COLUMN + 2 PIC 9 FROM LUNG-INFECTION.
          05 LINE + 1 COLUMN 11 VALUE "TEMPERATURE:".
          05 COLUMN + 2 PIC 9 FROM TEMPERATURE.
          05 LINE + 1 COLUMN 14 VALUE "SNIFFLES:".
          05 COLUMN + 2  PIC 9 FROM SNIFFLES.
          05 LINE + 1 COLUMN 11 VALUE "SORE-THROAT:".
          05 COLUMN + 2 PIC 9 FROM SORE-THROAT.
          05 LINE + 1 COLUMN 15 VALUE "This lable is ok(y/n):".
          05 COLUMN + 2 PIC X TO LABLE-OK .
       01 SCREEN-3
          BLANK SCREEN
          FOREGROUND-COLOR 2
          BACKGROUND-COLOR 7.
          05 LINE 10 COLUMN 15 VALUE "Do you want to another lable:".
          05 COLUMN + 2 PIC X TO ANOTHER-LABLE AUTO.
       PROCEDURE DIVISION.
         OPEN OUTPUT PATIENT.
         PERFORM UNTIL ANOTHER-LABLE = "N" OR ANOTHER-LABLE = "n"
             DISPLAY SCREEN-1
             ACCEPT SCREEN-1
             DISPLAY SCREEN-2
             ACCEPT SCREEN-2
             IF  LABLE-OK = "Y"  OR LABLE-OK = "y"
                 THEN PERFORM WORK-OUT
                      PERFORM FORM-PETIENT-REPORT
             END-IF
             DISPLAY SCREEN-3
             ACCEPT SCREEN-3
          END-PERFORM.
          CLOSE PATIENT.
       STOP RUN.
        WORK-OUT.
        IF( TEMPERATURE = 1 AND LUNG-INFECTION = 1)
           THEN
                MOVE "PNEUMONIA" TO DIAGNOSTIC
           ELSE
                IF(TEMPERATURE + LUNG-INFECTION + SNIFFLES + SORE-THROAT
      -             >= 2)
                   THEN
                        MOVE "COLD" TO DIAGNOSTIC
                   ELSE
                        MOVE "OK" TO
                        DIAGNOSTIC
                END-IF
        END-IF.
        FORM-PETIENT-REPORT.
        MOVE "DIAGNOSTIC REPORT"  TO PATIENT-INPUT.
        WRITE PATIENT-RECORD AFTER ADVANCING 1 LINE.
        MOVE "PATIENT-NAME:" TO PATIENT-INPUT.
        WRITE PATIENT-RECORD AFTER ADVANCING 1 LINE.
        MOVE PATIENT-NAME TO PATIENT-INPUT.
        WRITE PATIENT-RECORD AFTER ADVANCING 0 LINE.
        MOVE "LUNG-INFECTION:" TO PATIENT-INPUT.
        WRITE PATIENT-RECORD AFTER ADVANCING 1 LINE.
        MOVE LUNG-INFECTION TO PATIENT-INPUT.
        WRITE PATIENT-RECORD AFTER ADVANCING 0 LINE.
        MOVE "TEMPERATURE:" TO PATIENT-INPUT.
        WRITE PATIENT-RECORD AFTER ADVANCING 1 LINE.
        MOVE TEMPERATURE TO PATIENT-INPUT.
        WRITE PATIENT-RECORD AFTER ADVANCING 0 LINE.
        MOVE "SNIFFLES:" TO PATIENT-INPUT.
        WRITE PATIENT-RECORD AFTER ADVANCING 1 LINE.
        MOVE SNIFFLES TO PATIENT-INPUT.
        WRITE PATIENT-RECORD AFTER ADVANCING 0 LINE.
        MOVE "SORE-THROAT:" TO PATIENT-INPUT.
        WRITE PATIENT-RECORD AFTER ADVANCING 1 LINE.
        MOVE SORE-THROAT TO PATIENT-INPUT.
        WRITE PATIENT-RECORD AFTER ADVANCING 0 LINE.
        MOVE "DIAGNOSTIC:" TO PATIENT-INPUT.
        WRITE PATIENT-RECORD AFTER ADVANCING 1 LINE.
        MOVE DIAGNOSTIC TO PATIENT-INPUT.
        WRITE PATIENT-RECORD AFTER ADVANCING 0 LINE.
        MOVE "-----------------------------------" TO PATIENT-INPUT.
        WRITE PATIENT-RECORD AFTER ADVANCING 1 LINE.
