       IDENTIFICATION DIVISION.
         PROGRAM-ID.EMPLOYEE-REPORT.

       ENVIRONMENT DIVISION.
         INPUT-OUTPUT SECTION.
         FILE-CONTROL.
           SELECT SEQ-EMPLOYEE ASSIGN TO "EMPLOYEE.TXT"
             ORGANIZATION IS LINE SEQUENTIAL
             ACCESS MODE IS SEQUENTIAL.

           SELECT IND-EMPLOYEE ASSIGN TO "IND-EMPLOYEE.TXT"
             ORGANIZATION IS INDEXED
             ACCESS MODE IS DYNAMIC
             RECORD KEY IS IND-EMP-REC-KEY
             ALTERNATE RECORD KEY
               IS IND-EMP-REC-NAME WITH DUPLICATES
             FILE STATUS IS IND-EMP-STATUS.

           SELECT SEQ-REPORT ASSIGN TO "REPORT.TXT"
             ORGANIZATION IS LINE SEQUENTIAL
             ACCESS MODE IS SEQUENTIAL.

       DATA DIVISION.
         FILE SECTION.
           FD SEQ-EMPLOYEE.
             01 SEQ-EMP-RECORD.
               05 SEQ-EMP-REC-KEY.
                 10 SEQ-EMP-REC-DEPT     PIC  99.
                 10 SEQ-EMP-REC-TERR     PIC  99.
                 10 SEQ-EMP-REC-NUM      PIC 999.
               05 SEQ-EMP-REC-NAME       PIC X(20).
               05 SEQ-ANNUAL-SALARY      PIC 9(5)V.

           FD IND-EMPLOYEE.
             01 IND-EMP-RECORD.
               05 IND-EMP-REC-KEY VALUE ALL ZERO.
                 10 IND-EMP-REC-DEPT     PIC  99.
                 10 IND-EMP-REC-TERR     PIC  99.
                 10 IND-EMP-REC-NUM      PIC 999.
               05 IND-EMP-REC-NAME       PIC X(20).
               05 IND-ANNUAL-SALARY      PIC 9(5)V.

           FD SEQ-REPORT.
             01 SEQ-REP-RECORD.
               05 SEQ-NUM    PIC B(20)999.
               05 SEQ-NAME   PIC B(10)X(20).
               05 SEQ-SALARY PIC B(10)$$,$$$,$$9.99.

         WORKING-STORAGE SECTION.
           77 IND-EMP-STATUS PIC XX.
             88 END-OF-FILE VALUE HIGH-VALUES.

           77 PAGE-COUNT  PIC   99 VALUE 0.
           77 PAGE-COUNT-OUT PIC Z9.

           01 CUR-DATE.
             05 CUR-YEAR  PIC 9999.
             05 CUR-MONTH PIC   99.
             05 CUR-DAY   PIC   99.

           77 TOTAL-DEPT-SAL PIC 9(10)V9(2) VALUE ALL ZERO.
           77 TOTAL-DEPT-SAL-OUT PIC $$,$$$,$$$,$$9.99.

           77 TOTAL-TERR-SAL PIC 9(10)V9(2) VALUE ALL ZERO.
           77 TOTAL-TERR-SAL-OUT  PIC $$,$$$,$$$,$$9.99.

           77 TOTAL-ALL-SAL PIC 9(10)V9(2) VALUE ALL ZERO.
           77 TOTAL-ALL-SAL-OUT  PIC $$,$$$,$$$,$$9.99.

           77 DEPT-BREAK PIC 99 VALUE 00.
           77 TERR-BREAK PIC 99 VALUE 00.


       PROCEDURE DIVISION.
       100-MAIN.
         PERFORM 800-INIT.
         PERFORM 200-DATE.
         PERFORM 400-CALC.
         PERFORM 700-END-PROGRAM.
         PERFORM 900-END-JOB.
       STOP RUN.


       800-INIT.
      * create a indexed file
         OPEN INPUT SEQ-EMPLOYEE
         OPEN OUTPUT IND-EMPLOYEE

         READ SEQ-EMPLOYEE
           AT END SET END-OF-FILE TO TRUE
         END-READ

         MOVE ALL ZERO TO IND-EMP-REC-KEY
         START IND-EMPLOYEE KEY IS GREATER THAN IND-EMP-REC-KEY
      *    INVALID KEY
      *    WRITE IND-EMP-RECORD FROM "EMPLOYEE STATUS :- " AFTER 0
      *    WRITE IND-EMP-RECORD FROM IND-EMP-STATUS
         END-START

         PERFORM UNTIL END-OF-FILE

      *    WRITE IND-EMP-RECORD FROM SEQ-EMP-RECORD
      *      INVALID KEY
      *      WRITE IND-EMP-RECORD FROM "EMPLOYEE STATUS :- " AFTER 0
      *      WRITE IND-EMP-RECORD FROM IND-EMP-STATUS
      *    END-WRITE

           MOVE SEQ-EMP-REC-KEY TO IND-EMP-REC-KEY
           MOVE SEQ-EMP-REC-NAME TO IND-EMP-REC-NAME
           MOVE SEQ-ANNUAL-SALARY TO IND-ANNUAL-SALARY
           WRITE IND-EMP-RECORD

           READ SEQ-EMPLOYEE
             AT END SET END-OF-FILE TO TRUE
           END-READ
         END-PERFORM

         CLOSE SEQ-EMPLOYEE,IND-EMPLOYEE.


       200-DATE.
         MOVE FUNCTION CURRENT-DATE TO CUR-DATE.


       300-HEADING.
         WRITE SEQ-REP-RECORD FROM " " AFTER ADVANCING PAGE
         ADD 1 TO PAGE-COUNT

      * TO SHOW THE TITLE OF EACH PAGE
         WRITE SEQ-REP-RECORD FROM
         "                       A L P H A  D E P A R T M E N T  S T O R
      -" E   PAGE" AFTER 0
         MOVE PAGE-COUNT TO PAGE-COUNT-OUT
         WRITE SEQ-REP-RECORD FROM PAGE-COUNT-OUT
         WRITE SEQ-REP-RECORD FROM " "

         WRITE SEQ-REP-RECORD
           FROM "                          PAYROLL FOR THE WEEK OF "
             AFTER 0
      *  TO SHOW THE DATE IN THE FORM OF CUR-MONTH"/"CUR-DAY"/"CUR-YEAR
         WRITE SEQ-REP-RECORD FROM CUR-MONTH AFTER 0
         WRITE SEQ-REP-RECORD FROM "/"       AFTER 0
         WRITE SEQ-REP-RECORD FROM CUR-DAY   AFTER 0
         WRITE SEQ-REP-RECORD FROM "/"       AFTER 0
         WRITE SEQ-REP-RECORD FROM CUR-YEAR
         WRITE SEQ-REP-RECORD FROM " "

         WRITE SEQ-REP-RECORD FROM "      DEPARTMENT -   " AFTER 0
         WRITE SEQ-REP-RECORD FROM IND-EMP-REC-DEPT
         WRITE SEQ-REP-RECORD FROM " "

         WRITE SEQ-REP-RECORD FROM "      TERRITORY -    " AFTER 0
         WRITE SEQ-REP-RECORD FROM IND-EMP-REC-TERR
         WRITE SEQ-REP-RECORD FROM " "

         WRITE SEQ-REP-RECORD FROM
         "         EMPLOYEE NUMBER         EMPLOYEE NAME
      -" ANNUAL SALARY" .


       400-CALC.
         OPEN INPUT IND-EMPLOYEE
         OPEN OUTPUT SEQ-REPORT

         READ IND-EMPLOYEE NEXT RECORD
           AT END SET END-OF-FILE TO TRUE
         END-READ

         IF NOT END-OF-FILE
           MOVE IND-EMP-REC-DEPT TO DEPT-BREAK
           MOVE IND-EMP-REC-TERR TO TERR-BREAK
         END-IF

         PERFORM UNTIL END-OF-FILE
           PERFORM 500-DEPT-BREAK
         END-PERFORM

         WRITE SEQ-REP-RECORD FROM " "
         WRITE SEQ-REP-RECORD FROM " "
         WRITE SEQ-REP-RECORD FROM
         "                                         TOTAL OF SALARY IS"
         AFTER 0
         MOVE TOTAL-ALL-SAL TO TOTAL-ALL-SAL-OUT
         WRITE SEQ-REP-RECORD FROM TOTAL-ALL-SAL-OUT.


       500-DEPT-BREAK.

         PERFORM UNTIL IND-EMP-REC-DEPT<>DEPT-BREAK OR END-OF-FILE
           PERFORM 300-HEADING
           PERFORM 600-TERR-BREAK
         END-PERFORM

         WRITE SEQ-REP-RECORD FROM " "
         WRITE SEQ-REP-RECORD FROM " "
         WRITE SEQ-REP-RECORD FROM
       "                                TOTAL SALARY FOR DEPARTMENT IS "
           AFTER 0
         MOVE TOTAL-DEPT-SAL TO TOTAL-DEPT-SAL-OUT
         WRITE SEQ-REP-RECORD FROM TOTAL-DEPT-SAL-OUT

         ADD TOTAL-DEPT-SAL TO TOTAL-ALL-SAL
         MOVE ALL ZERO TO TOTAL-DEPT-SAL

         MOVE IND-EMP-REC-DEPT TO DEPT-BREAK.


       600-TERR-BREAK.

           PERFORM UNTIL IND-EMP-REC-TERR<>TERR-BREAK OR END-OF-FILE
             ADD IND-ANNUAL-SALARY TO TOTAL-DEPT-SAL
             ADD IND-ANNUAL-SALARY TO TOTAL-TERR-SAL

             WRITE SEQ-REP-RECORD FROM " "
               MOVE IND-EMP-REC-NUM TO SEQ-NUM
               MOVE IND-EMP-REC-NAME TO SEQ-NAME
               MOVE IND-ANNUAL-SALARY TO SEQ-SALARY
             WRITE SEQ-REP-RECORD

             READ IND-EMPLOYEE NEXT RECORD
               AT END SET END-OF-FILE TO TRUE
             END-READ
           END-PERFORM

           WRITE SEQ-REP-RECORD FROM " "
           WRITE SEQ-REP-RECORD FROM " "
           WRITE SEQ-REP-RECORD FROM
          "                              TOTAL SALARY FOR TERRITORY IS "
             AFTER 0
           MOVE TOTAL-TERR-SAL TO TOTAL-TERR-SAL-OUT
           WRITE SEQ-REP-RECORD FROM TOTAL-TERR-SAL-OUT


           MOVE ALL ZERO TO TOTAL-TERR-SAL

           MOVE IND-EMP-REC-TERR TO TERR-BREAK.


       700-END-PROGRAM.
          WRITE SEQ-REP-RECORD FROM "         END OF REPORT"
            AFTER ADVANCING 1 LINE.


       900-END-JOB.
          CLOSE IND-EMPLOYEE
          DELETE FILE IND-EMPLOYEE
          CLOSE SEQ-REPORT.
